run/multShock_methaneAirGlobal_2D/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    left
    {
        type            zeroGradient;
    }

    right
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        0;
        lInf            1e3;

        // type            zeroGradient;
    }

    wallsY
    {
        type            zeroGradient;
    }

    wallsZ
    {
        type            empty;
    }
}


// ************************************************************************* //
