run/multShock_methaneAirGlobal_2D/Allrun
#!/bin/bash -e
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

SCRIPT_DIR_NAME="$(basename $(pwd))"
touch "$SCRIPT_DIR_NAME".foam""

runApplication blockMesh

runApplication createPatch

runApplication setFields

runApplication foamRun

# ----------------------------------------------------------------- end-of-file
